import { Col, Row } from "antd";
import "./styles/style.css";
import InstagramIcon from '@mui/icons-material/Instagram';

const Footer = () => {
 
    return (<div className="c-footer">

        <Row className="row-footer">
            <Col sm={24}>
                <Row>
                    <Col className="footer-column" sm={24} xs={24} md={24} lg={3}>
                        
                        <div className="">
                            
                                <img src="Logo-nav.png" alt=""/>
                                <p className="inst-profile">
                                    @CrosShop
                                </p>

                            </div>
                    </Col>
                    <Col className="footer-column" lg={10} md={24}>
                            <div className="profile-main">
                                <h2 className="profile-name">CrosShop</h2>
                                
                                <p className="profile-body">Ласкаво просимо до нашого унікального магазину кросівок, де ми пропонуємо вам широкий вибір найкращих моделей,
                                    які привозяться безпосередньо з Європи. Ми гордимося нашим ексклюзивним асортиментом, який задовольнить навіть
                                    найвимогливіших любителів спортивного стилю.

                                    У нас ви знайдете кросівки від найвідоміших брендів, таких як Nike, Adidas, Puma, Reebok та багатьох інших.
                                    Ми працюємо безпосередньо з європейськими постачальниками, що дозволяє нам вам пропонувати оригінальні моделі високої якості.</p>
                            </div>
                        
                        
                    </Col>
                    <Col className="footer-column" offset={3} md={24} lg={8}>
                        <div className="container-number">
                            +38 0(54)623 45 32
                        </div>
                        <div className="container-email">
                            crosshop@gmail.com
                        </div>
                    </Col>
                </Row>
            </Col>

            <hr className="separator"/>
        </Row>
            
            <Row>
                    <Col sm={6} xs={6} md={6} lg={{span: 3, offset: 1}} xl={{span: 2, offset: 1}} xxl={{span: 2, offset: 1}}
                    >
                        <div className="blog-icon">
                            <svg xmlns="http://www.w3.org/2000/svg" height="1em" viewBox="0 0 496 512"><path d="M248,8C111.033,8,0,119.033,0,256S111.033,504,248,504,496,392.967,496,256,384.967,8,248,8ZM362.952,176.66c-3.732,39.215-19.881,134.378-28.1,178.3-3.476,18.584-10.322,24.816-16.948,25.425-14.4,1.326-25.338-9.517-39.287-18.661-21.827-14.308-34.158-23.215-55.346-37.177-24.485-16.135-8.612-25,5.342-39.5,3.652-3.793,67.107-61.51,68.335-66.746.153-.655.3-3.1-1.154-4.384s-3.59-.849-5.135-.5q-3.283.746-104.608,69.142-14.845,10.194-26.894,9.934c-8.855-.191-25.888-5.006-38.551-9.123-15.531-5.048-27.875-7.717-26.8-16.291q.84-6.7,18.45-13.7,108.446-47.248,144.628-62.3c68.872-28.647,83.183-33.623,92.511-33.789,2.052-.034,6.639.474,9.61,2.885a10.452,10.452,0,0,1,3.53,6.716A43.765,43.765,0,0,1,362.952,176.66Z"/></svg>
                            <span>Telegram</span>
                        </div>
                    </Col>

                    <Col sm={6} xs={6} md={6} lg={{span: 3, offset: 1}} xl={{span: 2, offset: 1}} xxl={{span: 2, offset: 1}}
                    >
                        <div className="blog-icon">
                        <svg xmlns="http://www.w3.org/2000/svg" height="1em" viewBox="0 0 448 512"><path d="M224,202.66A53.34,53.34,0,1,0,277.36,256,53.38,53.38,0,0,0,224,202.66Zm124.71-41a54,54,0,0,0-30.41-30.41c-21-8.29-71-6.43-94.3-6.43s-73.25-1.93-94.31,6.43a54,54,0,0,0-30.41,30.41c-8.28,21-6.43,71.05-6.43,94.33S91,329.26,99.32,350.33a54,54,0,0,0,30.41,30.41c21,8.29,71,6.43,94.31,6.43s73.24,1.93,94.3-6.43a54,54,0,0,0,30.41-30.41c8.35-21,6.43-71.05,6.43-94.33S357.1,182.74,348.75,161.67ZM224,338a82,82,0,1,1,82-82A81.9,81.9,0,0,1,224,338Zm85.38-148.3a19.14,19.14,0,1,1,19.13-19.14A19.1,19.1,0,0,1,309.42,189.74ZM400,32H48A48,48,0,0,0,0,80V432a48,48,0,0,0,48,48H400a48,48,0,0,0,48-48V80A48,48,0,0,0,400,32ZM382.88,322c-1.29,25.63-7.14,48.34-25.85,67s-41.4,24.63-67,25.85c-26.41,1.49-105.59,1.49-132,0-25.63-1.29-48.26-7.15-67-25.85s-24.63-41.42-25.85-67c-1.49-26.42-1.49-105.61,0-132,1.29-25.63,7.07-48.34,25.85-67s41.47-24.56,67-25.78c26.41-1.49,105.59-1.49,132,0,25.63,1.29,48.33,7.15,67,25.85s24.63,41.42,25.85,67.05C384.37,216.44,384.37,295.56,382.88,322Z"/></svg>
                            <span>Instagram</span>
                        </div>
                    </Col>

                    <Col sm={6} xs={6} md={6} lg={{span: 3, offset: 1}} xl={{span: 2, offset: 1}} xxl={{span: 2, offset: 1}}
                   >
                        <div className="blog-icon">
                            <svg xmlns="http://www.w3.org/2000/svg" height="1em" viewBox="0 0 448 512"><path d="M400 32H48A48 48 0 0 0 0 80v352a48 48 0 0 0 48 48h137.25V327.69h-63V256h63v-54.64c0-62.15 37-96.48 93.67-96.48 27.14 0 55.52 4.84 55.52 4.84v61h-31.27c-30.81 0-40.42 19.12-40.42 38.73V256h68.78l-11 71.69h-57.78V480H400a48 48 0 0 0 48-48V80a48 48 0 0 0-48-48z"/></svg>
                            <span>Facebook</span>
                        </div>
                    </Col>

                    <Col sm={5} xs={5} md={5} lg={{span: 3, offset: 4}} xl={{span: 3, offset: 7}} xxl={{span: 3, offset: 7}}
                    >
                        <div className="blog-icon">
                        <svg xmlns="http://www.w3.org/2000/svg" height="1em" viewBox="0 0 512 512"><path d="M256 512A256 256 0 1 0 256 0a256 256 0 1 0 0 512zM199.4 312.6c31.2 31.2 81.9 31.2 113.1 0c9.4-9.4 24.6-9.4 33.9 0s9.4 24.6 0 33.9c-50 50-131 50-181 0s-50-131 0-181s131-50 181 0c9.4 9.4 9.4 24.6 0 33.9s-24.6 9.4-33.9 0c-31.2-31.2-81.9-31.2-113.1 0s-31.2 81.9 0 113.1z"/></svg>
                            <span>Copyrighted 2023</span>
                        </div>

                    </Col>
                </Row>

            
</div>);
}

export default Footer;